Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 image_input (InputLayer)    [(None, None, None, 3)]   0

 Conv1 (Conv2D)              (None, None, None, 32)    896

 pool1 (MaxPooling2D)        (None, None, None, 32)    0

 Conv2 (Conv2D)              (None, None, None, 64)    18496

 pool2 (MaxPooling2D)        (None, None, None, 64)    0

 Conv3 (Conv2D)              (None, None, None, 64)    36928

 upsample1 (UpSampling2D)    (None, None, None, 64)    0

 Conv4 (Conv2D)              (None, None, None, 32)    18464

 upsample2 (UpSampling2D)    (None, None, None, 32)    0

 Conv5 (Conv2D)              (None, None, None, 3)     867

=================================================================
Total params: 75651 (295.51 KB)
Trainable params: 75651 (295.51 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
