Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 image_input (InputLayer)    [(None, 256, 256, 3)]     0         
                                                                 
 Conv1 (Conv2D)              (None, 256, 256, 32)      896       
                                                                 
 pool1 (MaxPooling2D)        (None, 128, 128, 32)      0         
                                                                 
 Conv2 (Conv2D)              (None, 128, 128, 64)      18496     
                                                                 
 pool2 (MaxPooling2D)        (None, 64, 64, 64)        0         
                                                                 
 Conv3 (Conv2D)              (None, 64, 64, 64)        36928     
                                                                 
 upsample1 (UpSampling2D)    (None, 128, 128, 64)      0         
                                                                 
 Conv4 (Conv2D)              (None, 128, 128, 32)      18464     
                                                                 
 upsample2 (UpSampling2D)    (None, 256, 256, 32)      0         
                                                                 
 Conv5 (Conv2D)              (None, 256, 256, 3)       867       
                                                                 
=================================================================
Total params: 75651 (295.51 KB)
Trainable params: 75651 (295.51 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
