Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 image_input (InputLayer)    [(None, 256, 256, 3)]     0         
                                                                 
 ConvEnc1 (Conv2D)           (None, 256, 256, 64)      1792      
                                                                 
 pool1 (MaxPooling2D)        (None, 128, 128, 64)      0         
                                                                 
 ConvEnc2 (Conv2D)           (None, 128, 128, 128)     73856     
                                                                 
 pool2 (MaxPooling2D)        (None, 64, 64, 128)       0         
                                                                 
 ConvDec1 (Conv2D)           (None, 64, 64, 128)       147584    
                                                                 
 upsample1 (UpSampling2D)    (None, 128, 128, 128)     0         
                                                                 
 ConvDec2 (Conv2D)           (None, 128, 128, 64)      73792     
                                                                 
 upsample2 (UpSampling2D)    (None, 256, 256, 64)      0         
                                                                 
 ConvDec3 (Conv2D)           (None, 256, 256, 3)       1731      
                                                                 
=================================================================
Total params: 298755 (1.14 MB)
Trainable params: 298755 (1.14 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
